package com.queen;

/***
 *
 *  .--,       .--,
 * ( (  \.---./  ) )
 *  '.__/o   o\__.'
 *     {=  ^  =}
 *      >  -  <
 *     /       \
 *    //       \\
 *   //|   .   |\\
 *   "'\       /'"_.-~^`'-.
 *      \  _  /--'         `
 *    ___)( )(___
 *   (((__) (__)))    高山仰止,景行行止.虽不能至,心向往之。
 */
public class Main {
    /**
     *
     * IO
     * I-----Input 输入
     * O-----Output 输出
     *
     * InputStream 输入流
     * OutputStream 输出流
     *
     * 字节码  应用于 媒体文件处理 图片 音视频....也可以处理文字
     * 字符码 主要应用于文字的处理
     *
     * File类  文件类
     */

}
