package com.queen;

/***
 *
 *  .--,       .--,
 * ( (  \.---./  ) )
 *  '.__/o   o\__.'
 *     {=  ^  =}
 *      >  -  <
 *     /       \
 *    //       \\
 *   //|   .   |\\
 *   "'\       /'"_.-~^`'-.
 *      \  _  /--'         `
 *    ___)( )(___
 *   (((__) (__)))    高山仰止,景行行止.虽不能至,心向往之。
 */
public class Main {
    public static void main(String[] args) {
        /**
         * xml 数据
         * xml是一种国际通用的数据格式
         * 最大的优点 跨平台 标记性语言 标签<></> 成组  </>单标签
         *
         * 了解xml数据的格式
         * 如何利用java代码生成XML数据
         * 如何使用xml数据(解析)
         * 解析就是将数据提取出来的过程
         *
         *
         * jar包
         * 先创建一个文件夹
         */







    }
}
