package com.queen;

/***
 *
 *  .--,       .--,
 * ( (  \.---./  ) )
 *  '.__/o   o\__.'
 *     {=  ^  =}
 *      >  -  <
 *    //       \\
 *   //|   .   |\\
 *   "'\       /'"_.-~^`'-.
 *      \  _  /--'         `
 *    ___)( )(___
 *   (((__) (__)))    高山仰止,景行行止.虽不能至,心向往之。
 */
public class Main {
    public static void main(String[] args) {
        /**
         * 编写客户端 以及服务端
         * 客户端 client
         * 服务端 server 可以有n个
         *
         * 172.16.16.119 客户端
         *
         * 需求 客户端向服务端发送信息 服务端接收信息 打印在控制台
         *
         */
    }
}
